---
type: PointCloudOverrideSettings
namespace: Autodesk.Revit.DB.PointClouds
version: 2024
members: 10
tags: [revit-api, class]
---

# PointCloudOverrideSettings

`Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PointCloudOverrideSettings | — | `` |
| Constructor | PointCloudOverrideSettings | 2014 | `public PointCloudOverrideSettings ()` |
| Method | Assign | 2014 | `public void Assign ( PointCloudOverrideSettings other )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetModeOverride | 2014 | `public PointCloudColorSettings GetModeOverride ( PointCloudColorMode mode )` |
| Method | IsEqual | 2014 | `public bool IsEqual ( PointCloudOverrideSettings other )` |
| Method | SetModeOverride | 2014 | `public void SetModeOverride ( PointCloudColorMode mode , PointCloudColorSettings colorSettings )` |
| Property | ColorMode | 2014 | `public PointCloudColorMode ColorMode { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Visible | 2014 | `public bool Visible { get ; set ; }` |